000_РОЗНИЦА_ЦЕНТР/src/Catalogs/СтруктураУзлов/СтруктураУзлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураУзлов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>MSDyn_CRM</name>
      <description>MS Dynamics CRM</description>
    </items>
    <items>
      <name>КСУ_Navision</name>
      <description>Корпоративная Система Управления (внешний источник Navision)</description>
    </items>
    <items>
      <name>ЦентральныйОфис</name>
      <description>ЦЕНТРАЛЬНЫЙ ОФИС</description>
    </items>
  </predefined>
  <attributes>
    <name>Account</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BaseName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУзла</name>
    <type>
      <types>EnumRef.ВидыУзлов</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогФайловОбновления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогФайловРезервныхКопий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПрограммы</name>
    <type>
      <types>EnumRef.ПрограммаМобильногоУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧрезвычайноеПоложение</name>
    <comment>Вне доступа из-за войны</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Алгоритмы</name>
    <attributes>
      <name>Алгоритм</name>
      <comment>Алгоритм, назначенный для выполнения в текущем узле</comment>
      <type>
        <types>CatalogRef.Алгоритмы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполнятьАлгоритм</name>
      <type>
        <types>EnumRef.ВыполнятьАлгоритм</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Магазины</name>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроизвольныеДанные</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезервныеКопии</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СетевыеИнтерфейсы</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Магазины/Магазины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Магазины</name>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВЭксплуатацию</name>
    <comment>Магазин переведен в режим работы 1С:Розница</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМинимальныхЦенПродажи</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПользователей</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПеремещении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрименениеЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрямуюИнкассацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаМагазина</name>
    <comment>Основная денежная касса магазина</comment>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБюджета</name>
    <type>
      <types>CatalogRef.КодыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодФилиала</name>
    <comment>Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМагазина</name>
    <comment>Используется для начальной загрузки из MForce</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделениеОрганизации</name>
    <comment>Определяет филиал</comment>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменаРучныхСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругленияСуммыЧекаВПользуПокупателя</name>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоЦенообразования</name>
    <type>
      <types>CatalogRef.ПравилаЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментИсключаемойНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПереброски</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоступления</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладСвязи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладУправляющейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматМагазина</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/ПрефиксацияОбъектовСобытия/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Префиксация объектов"
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Устанавливает префикс источника подписки в соответствии с префиксом организации. 
// Источник подписки должен содержать
// обязательный реквизит шапки "Организация", тип: "СправочникСсылка.Организации"
//
// Параметры:
//  Источник - Источник события подписки.
//             Любой объект из множества [Справочник, Документ, План видов характеристик, Бизнес процесс, Задача]
// СтандартнаяОбработка - Булево - флаг стандартной обработки подписки
// Префикс - Строка - префикс объекта, который нужно изменить
//
Процедура УстановитьПрефиксОрганизации(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Если НЕ ПрефиксацияОбъектовПовтИсп.ИспользоватьНомерМагазинаКакПрефикс() ИЛИ ПрефиксацияГлавногоУзла() Тогда

		УстановитьПрефикс(Источник, Префикс, Ложь, Истина);

	Иначе
	//	LNK 07.04.2017 16:52:00
		УстановитьПрефиксОбщий(Источник, Префикс);

	КонецЕсли;
	
КонецПроцедуры

// Устанавливает префикс источника подписки в соответствии с префиксом информационной базы.
// Ограничения на реквизиты источника не накладываются
//
// Параметры:
//  Источник - Источник события подписки.
//             Любой объект из множества [Справочник, Документ, План видов характеристик, Бизнес процесс, Задача]
// СтандартнаяОбработка - Булево - флаг стандартной обработки подписки
// Префикс - Строка - префикс объекта, который нужно изменить
//
Процедура УстановитьПрефиксИнформационнойБазы(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Если (НЕ ПрефиксацияОбъектовПовтИсп.ИспользоватьНомерМагазинаКакПрефикс() ИЛИ ПрефиксацияГлавногоУзла())
	И НЕ ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(Источник.ДополнительныеСвойства, "ИспользоватьНомерМагазинаКакПрефикс", Ложь)
	Тогда

		УстановитьПрефикс(Источник, Префикс, Истина, Ложь);

	Иначе

	//	LNK 07.04.2017 16:52:00
		УстановитьПрефиксОбщий(Источник, Префикс);

	КонецЕсли;
	
КонецПроцедуры

// Устанавливает префикс источника подписки в соответствии с префиксом информационной базы и префиксом организации.
// Источник подписки должен содержать
// обязательный реквизит шапки "Организация", тип: "СправочникСсылка.Организации"
//
// Параметры:
//  Источник - Источник события подписки.
//             Любой объект из множества [Справочник, Документ, План видов характеристик, Бизнес процесс, Задача]
// СтандартнаяОбработка - Булево - флаг стандартной обработки подписки
// Префикс - Строка - префикс объекта, который нужно изменить
//
Процедура УстановитьПрефиксИнформационнойБазыИОрганизации(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Если НЕ ПрефиксацияОбъектовПовтИсп.ИспользоватьНомерМагазинаКакПрефикс() ИЛИ ПрефиксацияГлавногоУзла() Тогда

		УстановитьПрефикс(Источник, Префикс, Истина, Истина);

	Иначе
	//	LNK 07.04.2017 16:52:00
		УстановитьПрефиксОбщий(Источник, Префикс);

	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Для справочников

// Выполняет проверку модифицированности реквизита Организация элемента справочника
// Если реквизит Организация изменен, то Код элемента обнуляется.
// Это необходимо для назначения нового кода элементу
//
// Параметры:
//  Источник - СправочникОбъект - источник события подписки
//  Отказ    - Булево - флаг отказа
// 
Процедура ПроверитьКодСправочникаПоОрганизации(Источник, Отказ) Экспорт
	
	ПроверитьКодОбъектаПоОрганизации(Источник);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Для бизнес-процессов

// Выполняет проверку модифицированности Даты бизнес процесса
// Если дата не входит в предыдущий период, то номер бизнес процесса обнуляется.
// Это необходимо для назначения нового номера бизнес процессу
//
// Параметры:
//  Источник - БизнесПроцессОбъект - источник события подписки
//  Отказ    - Булево - флаг отказа
// 
Процедура ПроверитьНомерБизнесПроцессаПоДате(Источник, Отказ) Экспорт
	
	ПроверитьНомерОбъектаПоДате(Источник);
	
КонецПроцедуры

// Выполняет проверку модифицированности Даты и Организации бизнес процесса
// Если дата не входит в предыдущий период или изменен реквизит Организация, то номер бизнес процесса обнуляется.
// Это необходимо для назначения нового номера бизнес процессу
//
// Параметры:
//  Источник - БизнесПроцессОбъект - источник события подписки
//  Отказ    - Булево - флаг отказа
// 
Процедура ПроверитьНомерБизнесПроцессаПоДатеИОрганизации(Источник, Отказ) Экспорт
	
	ПроверитьНомерОбъектаПоДатеИОрганизации(Источник);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Для документов

// Выполняет проверку модифицированности Даты документа
// Если дата не входит в предыдущий период, то номер документа обнуляется.
// Это необходимо для назначения нового номера документу
//
// Параметры:
//  Источник - ДокументОбъект - источник события подписки
//  Отказ    - Булево - флаг отказа
// 
Процедура ПроверитьНомерДокументаПоДате(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если НЕ ПрефиксацияОбъектовПовтИсп.ИспользоватьНомерМагазинаКакПрефикс() Тогда

		ПроверитьНомерОбъектаПоДате(Источник);

	КонецЕсли;
	
КонецПроцедуры

// Выполняет проверку модифицированности Даты и Организации документа
// Если дата не входит в предыдущий период или изменен реквизит Организация, то номер документа обнуляется.
// Это необходимо для назначения нового номера документу
//
// Параметры:
//  Источник - ДокументОбъект - источник события подписки
//  Отказ    - Булево - флаг отказа
// 
Процедура ПроверитьНомерДокументаПоДатеИОрганизации(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если НЕ ПрефиксацияОбъектовПовтИсп.ИспользоватьНомерМагазинаКакПрефикс() Тогда

		ПроверитьНомерОбъектаПоДатеИОрганизации(Источник);

	КонецЕсли;
	
КонецПроцедуры

// Выполняет проверку модифицированности Даты и Магазину документа
// Если дата не входит в предыдущий период или изменен реквизит Магазин, то номер документа обнуляется.
// Это необходимо для назначения нового номера документу
//
// Параметры:
//  Источник - ДокументОбъект - источник события подписки
//  Отказ    - Булево - флаг отказа
//	LNK 14.04.2017 12:05:57
Процедура ПроверитьНомерДокументаПоДатеИМагазину(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	Если ПрефиксацияОбъектовПовтИсп.ИспользоватьНомерМагазинаКакПрефикс() Тогда

		ПроверитьНомерОбъектаПоДатеИМагазину(Источник);

	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура УстановитьПрефикс(Источник, Префикс, УстановитьПрефиксИнформационнойБазы, УстановитьПрефиксОрганизации)
	
	ПрефиксИнформационнойБазы = "";
	ПрефиксОрганизации        = "";
	
	Если УстановитьПрефиксИнформационнойБазы Тогда
		
		Если НЕ Источник.ДополнительныеСвойства.Свойство("Префикс") Тогда	//	LNK 13.02.2017 16:10:10

				ПерепрефиксацияОбъектов.ПриОпределенииПрефиксаИнформационнойБазы(ПрефиксИнформационнойБазы);

		Иначе	ПрефиксИнформационнойБазы = Источник.ДополнительныеСвойства.Префикс;	//	LNK 13.02.2017 16:10:15

		КонецЕсли;
		
		Если НЕ Источник.ДополнительныеСвойства.Свойство("ПрефиксНеДополнять") Тогда

			ДополнитьСтрокуНулямиСлева(ПрефиксИнформационнойБазы, 3);

		КонецЕсли;

	КонецЕсли;
	
	Если УстановитьПрефиксОрганизации Тогда
		
		Если РеквизитОрганизацияДоступен(Источник) Тогда
			
			ПерепрефиксацияОбъектов.ПриОпределенииПрефиксаОрганизации(
				Источник[ИмяРеквизитаОрганизация(Источник.Метаданные())], ПрефиксОрганизации
			);
			// если задана пустая ссылка на организацию
			Если ПрефиксОрганизации = Ложь Тогда
				
				ПрефиксОрганизации = "";
				
			КонецЕсли;
			
		КонецЕсли;
		
	//	ДополнитьСтрокуНулямиСлева(ПрефиксОрганизации, 2);
	//	LNK 27.10.2016 13:45:15
		ДополнитьСтрокуНулямиСлева(ПрефиксОрганизации, 1);

	КонецЕсли;

//	LNK 27.10.2016 13:40:25
	ШаблонПрефикса = "[О][ИБД]-[Префикс]";
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[О]"      , ПрефиксОрганизации);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ИБД]"    , ПрефиксИнформационнойБазы);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[Префикс]", Префикс);

	Префикс = ШаблонПрефикса;
	
КонецПроцедуры

Процедура ДополнитьСтрокуНулямиСлева(Строка, ДлинаСтроки)
	
	Строка = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Строка, ДлинаСтроки, "0", "Слева");
	
КонецПроцедуры

Процедура ПроверитьНомерОбъектаПоДате(Объект)
	
	Если Объект.ОбменДанными.Загрузка Тогда
		Возврат;
	ИначеЕсли Объект.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеОбъекта = Объект.Метаданные();
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ШапкаОбъекта.Дата КАК Дата
	|ИЗ
	|	" + МетаданныеОбъекта.ПолноеИмя() + " КАК ШапкаОбъекта
	|ГДЕ
	|	ШапкаОбъекта.Ссылка = &Ссылка
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если Не ПрефиксацияОбъектовВызовСервера.ДатыОбъектаОдногоПериода(Выборка.Дата, Объект.Дата, Объект.Ссылка) Тогда
		
		Объект.Номер = "";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНомерОбъектаПоДатеИОрганизации(Объект)

	Если Объект.ОбменДанными.Загрузка ИЛИ Объект.ЭтоНовый() ИЛИ НомерНазначенВоВнешнейСистеме(Объект) Тогда

		Возврат;

	КонецЕсли;

	Если ПрефиксацияОбъектовВызовСервера.ДатаИлиОрганизацияОбъектаИзменена(
			Объект.Ссылка,
			Объект.Дата,
			Объект[ИмяРеквизитаОрганизация(Объект.Метаданные())],
			Объект.Метаданные().ПолноеИмя())
		Тогда

		Объект.Номер = "";

	КонецЕсли;
	
КонецПроцедуры

//	LNK 14.04.2017 12:16:26
Процедура ПроверитьНомерОбъектаПоДатеИМагазину(Объект)

	Если Объект.ОбменДанными.Загрузка ИЛИ Объект.ЭтоНовый() ИЛИ НомерНазначенВоВнешнейСистеме(Объект) Тогда

		Возврат;

	КонецЕсли;

	МетаданныеОбъекта   = Объект.Метаданные();
	ИмяРеквизитаМагазин = ИмяРеквизитаМагазин(МетаданныеОбъекта);

	Если ОбщегоНазначенияРТ.ЕстьРеквизитОбъекта(ИмяРеквизитаМагазин, МетаданныеОбъекта) Тогда
		
		Если ПрефиксацияОбъектовВызовСервера.ДатаИлиМагазинОбъектаИзменены(
				Объект.Ссылка,
				Объект.Дата,
				Объект[ИмяРеквизитаМагазин],
				МетаданныеОбъекта.ПолноеИмя())
			Тогда
			
			Объект.Номер = "";
			
		КонецЕсли;

	Иначе

		ПроверитьНомерОбъектаПоДате(Объект);

	КонецЕсли;

КонецПроцедуры

//	LNK 17.04.2018 09:56:49
Функция НомерНазначенВоВнешнейСистеме(Объект)	Экспорт

	НомерВнешний = Ложь;

	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда

		НомерВнешний = (Объект.УзелСоздания = Справочники.СтруктураУзлов.КСУ_Navision);

	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказПокупателя") Тогда

		//НомерВнешний = (Объект.УчетнаяСистема = Перечисления.УчетныеСистемыКомпании.Magento);
		НомерВнешний = Истина;

	КонецЕсли;

	Возврат НомерВнешний;

КонецФункции

Процедура ПроверитьКодОбъектаПоОрганизации(Объект)
	
	Если Объект.ОбменДанными.Загрузка Тогда
		Возврат;
	ИначеЕсли Объект.ЭтоНовый() Тогда
		Возврат;
	ИначеЕсли Не РеквизитОрганизацияДоступен(Объект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПрефиксацияОбъектовВызовСервера.ОрганизацияОбъектаИзменена(
			Объект.Ссылка,
			Объект[ИмяРеквизитаОрганизация(Объект.Метаданные())],
			Объект.Метаданные().ПолноеИмя())
		Тогда
		
		Объект.Код = "";
		
	КонецЕсли;
	
КонецПроцедуры

Функция РеквизитОрганизацияДоступен(Объект)
	
	// возвращаемое значение функции
	Результат = Истина;
	
	МетаданныеОбъекта = Объект.Метаданные();
	
	Если   (ОбщегоНазначения.ЭтоСправочник(МетаданныеОбъекта)
		ИЛИ ОбщегоНазначения.ЭтоПланВидовХарактеристик(МетаданныеОбъекта))
		И МетаданныеОбъекта.Иерархический Тогда
		
		ИмяРеквизитаОрганизация = ИмяРеквизитаОрганизация(МетаданныеОбъекта);
		
		РеквизитОрганизация = МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизитаОрганизация);
		
		Если РеквизитОрганизация = Неопределено Тогда
			
			Если ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеОбъекта.СтандартныеРеквизиты, ИмяРеквизитаОрганизация) Тогда
				
				// Стандартный реквизит всегда доступен и для элемента и для группы.
				Возврат Истина;
				
			КонецЕсли;
			
			СтрокаСообщения = НСтр("ru = 'Для объекта метаданных %1 не определен реквизит с именем %2.'");
			СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, МетаданныеОбъекта.ПолноеИмя(), ИмяРеквизитаОрганизация);
			ВызватьИсключение СтрокаСообщения;
		КонецЕсли;
			
		Если РеквизитОрганизация.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы И Не Объект.ЭтоГруппа Тогда
			
			Результат = Ложь;
			
		ИначеЕсли РеквизитОрганизация.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента И Объект.ЭтоГруппа Тогда
			
			Результат = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Для внутреннего использования
Функция ИмяРеквизитаОрганизация(Объект) Экспорт
	
	Если ТипЗнч(Объект) = Тип("ОбъектМетаданных") Тогда
		ПолноеИмя = Объект.ПолноеИмя();
	Иначе
		ПолноеИмя = Объект;
	КонецЕсли;
	
//	Реквизит = ПрефиксацияОбъектовПовтИсп.ПрефиксообразующиеРеквизиты().Получить(ПолноеИмя);
	Реквизит = Неопределено;	//	LNK 07.04.2017 15:45:07
	
	Если Реквизит <> Неопределено Тогда
		Возврат Реквизит;
	КонецЕсли;
	
	Возврат "Организация";
	
КонецФункции

//	LNK 06.05.2017 07:30:34
Функция ПрефиксацияГлавногоУзла()

	Возврат ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() И ПараметрыСеанса.ИмитацияПериферийногоУзла = Ложь;

КонецФункции // ПрефиксацияГлавногоУзла()

#Область ФормированиеПрефиксаНомераИлиКодаОбъекта

//	LNK 07.04.2017 15:20:20
Процедура УстановитьПрефиксОбщий(Источник, Префикс)
	
	ВедущийПрефикс = "";

	Если РеквизитМагазинДоступен(Источник) Тогда

		ПерепрефиксацияОбъектов.ПриОпределенииПрефиксаМагазина(
			Источник[ИмяРеквизитаМагазин(Источник.Метаданные(), Источник)], ВедущийПрефикс
		);

		ДополнитьСтрокуНулямиСлева(ВедущийПрефикс, 4);

	Иначе

		Если НЕ Источник.ДополнительныеСвойства.Свойство("Префикс") Тогда	//	LNK 13.02.2017 16:10:10

				ПерепрефиксацияОбъектов.ПриОпределенииПрефиксаИнформационнойБазы(ВедущийПрефикс);

		Иначе	ВедущийПрефикс = Источник.ДополнительныеСвойства.Префикс;	//	LNK 13.02.2017 16:10:15

		КонецЕсли;
		
		ДополнитьСтрокуНулямиСлева(ВедущийПрефикс, 3);

	КонецЕсли;

	ШаблонПрефикса = "[ВЕДП]-[Префикс]";
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ВЕДП]"   , ВедущийПрефикс);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[Префикс]", Префикс);

	Префикс = ШаблонПрефикса;

КонецПроцедуры

//	LNK 07.04.2017 15:28:56
Функция РеквизитМагазинДоступен(Объект)

//	Возвращаемое значение функции
	Результат = Ложь;

	МетаданныеОбъекта = Объект.Метаданные();

	Если   (ОбщегоНазначения.ЭтоСправочник(МетаданныеОбъекта)
		ИЛИ ОбщегоНазначения.ЭтоПланВидовХарактеристик(МетаданныеОбъекта))
		И МетаданныеОбъекта.Иерархический Тогда

		ИмяРеквизитаМагазин = ИмяРеквизитаМагазин(МетаданныеОбъекта);
		РеквизитМагазин     = МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизитаМагазин);

		Если РеквизитМагазин = Неопределено Тогда

			Если ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеОбъекта.СтандартныеРеквизиты, ИмяРеквизитаМагазин) Тогда

			//	Стандартный реквизит всегда доступен и для элемента и для группы.
				Возврат Истина;

			Иначе

				Возврат Ложь;

			КонецЕсли;

		КонецЕсли;

		Если РеквизитМагазин.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы И Не Объект.ЭтоГруппа Тогда

			Результат = Ложь;

		ИначеЕсли РеквизитМагазин.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента И Объект.ЭтоГруппа Тогда

			Результат = Ложь;

		КонецЕсли;

	ИначеЕсли ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта) Тогда

		ИмяРеквизитаМагазин = ИмяРеквизитаМагазин(МетаданныеОбъекта, Объект);
		Результат = НЕ МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизитаМагазин) = Неопределено;

	КонецЕсли;

	Возврат Результат;

КонецФункции // РеквизитМагазинДоступен()

//	LNK 07.04.2017 15:35:18
Функция ИмяРеквизитаМагазин(МетаданныеОбъекта, Объект = Неопределено)	Экспорт

	Если ТипЗнч(МетаданныеОбъекта) = Тип("ОбъектМетаданных") Тогда

			ПолноеИмя = МетаданныеОбъекта.ПолноеИмя();

	Иначе	ПолноеИмя = МетаданныеОбъекта;

	КонецЕсли;

	Если НЕ Объект = Неопределено И ПрефиксацияОбъектовПовтИсп.ПрефиксообразованиеДляПеремещения(ПолноеИмя) Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(&МагазинОтправитель КАК Справочник.Магазины) КАК МагазинОтправитель,
		|	ВЫРАЗИТЬ(&МагазинПолучатель КАК Справочник.Магазины) КАК МагазинПолучатель
		|ПОМЕСТИТЬ Источник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""МагазинОтправитель"" КАК ИмяРеквизита,
		|	1 КАК КлючПорядка
		|ИЗ
		|	Источник КАК Источник
		|ГДЕ
		|	НЕ Источник.МагазинОтправитель.СкладУправляющейСистемы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""МагазинПолучатель"",
		|	2
		|ИЗ
		|	Источник КАК Источник
		|ГДЕ
		|	НЕ Источник.МагазинПолучатель.СкладУправляющейСистемы
		|
		|УПОРЯДОЧИТЬ ПО
		|	КлючПорядка УБЫВ"
		);
		Запрос.УстановитьПараметр("МагазинОтправитель", Объект.МагазинОтправитель);
		Запрос.УстановитьПараметр("МагазинПолучатель" , Объект.МагазинПолучатель);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда

			Возврат Выборка.ИмяРеквизита;

		Иначе

			Возврат ПрефиксацияОбъектовПовтИсп.ПрефиксообразующиеРеквизиты().Получить(ПолноеИмя);

		КонецЕсли;

	Иначе

		Реквизит = ПрефиксацияОбъектовПовтИсп.ПрефиксообразующиеРеквизиты().Получить(ПолноеИмя);

		Если НЕ Реквизит = Неопределено Тогда

			Возврат Реквизит;

		КонецЕсли;

	КонецЕсли;

	Возврат "Магазин";

КонецФункции // ИмяРеквизитаМагазин()

#КонецОбласти
